output/posts/2017-08-09-org-journal-search-excludes-the-start-and-end-date.org
* org-journal-search excludes the start and end date
   :PROPERTIES:
   :Time:     12:53
   :END:

org-journal-search asks for the start and end date of the time window to
search. It turns out that it searches between those dates but not at those
dates.

In org-journal.el, function org-journal-search-build-file-list retrieves the
files "within a given time interval". Its implementation shows that it
retrieves the files later than the start of the interval and earlier than the
end of the interval:
#+BEGIN_SRC emacs-lisp
((and period-start period-end
      (time-less-p period-start filetime)
      (time-less-p filetime period-end))
 (push file result))
#+END_SRC

I considered creating a GitHub issue for this but refrained from doing. It
seems it has not been an issue for anybody else in the last years.
